0.orig/H2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

// H2 质量分数模板; setFields 按 H2_PERCENT 写入实际未燃混合气与点火核
internalField   uniform 0;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
