0.orig/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

// O2 质量分数模板 (氧化剂为纯 O2); setFields 会按混合气覆盖
internalField   uniform 1;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
