Allrun
#!/bin/bash
# Run script for H2-O2 spherical flame LES case (pure O2 oxidizer, no N2)
# Targets OpenFOAM 12 (foamRun + multicomponentFluid module).
# Usage: ./Allrun [H2_PERCENT]
#   H2_PERCENT: vol% H2 in O2 (default 8)
#   Equivalence ratio: phi = (x/(1-x))/2  ->  10% => phi=0.056 (very lean)
#                                              66.7% => phi=1 (stoichiometric)
#   NOTE: for rich mixtures (phi>1) change defaultSpecie in
#         constant/physicalProperties from O2 to H2O.

# Source OpenFOAM env BEFORE set -e: the bashrc returns non-zero internally
# and would silently kill the script otherwise.
FOAM_BASHRC=${FOAM_BASHRC:-/opt/openfoam12/etc/bashrc}
if [ ! -f "$FOAM_BASHRC" ]; then
    echo "ERROR: $FOAM_BASHRC not found. Install OpenFOAM 12, or set"
    echo "       FOAM_BASHRC to its etc/bashrc path before running ./Allrun." >&2
    exit 1
fi
source "$FOAM_BASHRC"
set -e

H2_PERCENT=${1:-8}
echo "=== H2-O2 Spherical Flame LES: ${H2_PERCENT}% H2 in O2 ==="

# Calculate unburned mixture and burned-kernel mass fractions,
# then write system/setFieldsDict
python3 - <<PYEOF
x = $H2_PERCENT / 100.0           # H2 volume (mole) fraction in H2/O2 mixture
M_H2, M_O2, M_H2O = 2.016, 32.0, 18.016

# --- unburned H2/O2 mixture ---
M_mix = x*M_H2 + (1-x)*M_O2
Y_H2 = x*M_H2 / M_mix
Y_O2 = (1-x)*M_O2 / M_mix
phi  = (x/(1-x)) / 2.0            # H2 + 0.5 O2 -> H2O

# --- complete-combustion products for the ignition kernel ---
n_H2, n_O2 = x, 1.0-x
if phi <= 1.0:                    # lean: excess O2
    p_H2O, p_O2, p_H2 = n_H2, n_O2 - n_H2/2.0, 0.0
else:                             # rich: excess H2
    p_H2O, p_O2, p_H2 = 2.0*n_O2, 0.0, n_H2 - 2.0*n_O2
m_tot  = p_H2O*M_H2O + p_O2*M_O2 + p_H2*M_H2
Yb_H2O = p_H2O*M_H2O / m_tot
Yb_O2  = p_O2 *M_O2  / m_tot
Yb_H2  = p_H2 *M_H2  / m_tot

print(f"  x_H2={x:.3f}  phi={phi:.3f}")
print(f"  unburned: Y_H2={Y_H2:.4f}  Y_O2={Y_O2:.4f}")
print(f"  kernel:   Y_H2O={Yb_H2O:.4f}  Y_O2={Yb_O2:.4f}  Y_H2={Yb_H2:.4f}")

with open('system/setFieldsDict', 'w') as f:
    f.write(f'''/*
  Set initial fields (generated by Allrun for {x*100:.1f} vol% H2 in O2):
  - Outer domain: unburned H2-O2 mixture, T=298K
  - Ignition kernel (r < 3mm): complete-combustion products at T=2000K
  phi = {phi:.3f}
*/
FoamFile {{ version 2.0; format ascii; class dictionary; object setFieldsDict; }}

// ---------- unburned mixture ----------
defaultFieldValues
(
    volScalarFieldValue T       298.0
    volScalarFieldValue p        101325.0
    volVectorFieldValue U       (0 0 0)
    volScalarFieldValue H2      {Y_H2:.4f}
    volScalarFieldValue O2      {Y_O2:.4f}
    volScalarFieldValue N2      0.0
    volScalarFieldValue H2O     0.0
    volScalarFieldValue H       0.0
    volScalarFieldValue O       0.0
    volScalarFieldValue OH      0.0
    volScalarFieldValue HO2     0.0
    volScalarFieldValue H2O2    0.0
);

regions
(
    // Ignition kernel: hot products (T=2000K, r < 3mm)
    sphereToCell
    {{
        centre  (0 0 0);
        radius  0.003;
        fieldValues
        (
            volScalarFieldValue T       2000.0
            volScalarFieldValue H2      {Yb_H2:.4f}
            volScalarFieldValue O2      {Yb_O2:.4f}
            volScalarFieldValue N2      0.0
            volScalarFieldValue H2O     {Yb_H2O:.4f}
            volScalarFieldValue H       0.0
            volScalarFieldValue O       0.0
            volScalarFieldValue OH      0.0
            volScalarFieldValue HO2     0.0
            volScalarFieldValue H2O2    0.0
        );
    }}
);
''')
print("  setFieldsDict written.")
PYEOF

# Step 1: Generate mesh
echo "--- blockMesh ---"
blockMesh > log.blockMesh 2>&1

# Step 2: Restore pristine initial fields, then set hot kernel + unburned mixture.
#   0.orig holds small uniform template fields (version-controlled);
#   setFields overwrites 0/ in place, so we always start from a clean copy.
echo "--- restore 0/ from 0.orig ---"
rm -rf 0
cp -r 0.orig 0
echo "--- setFields ---"
setFields > log.setFields 2>&1

# Step 3: Decompose for parallel run
echo "--- decomposePar ---"
decomposePar -force > log.decompose 2>&1

# Step 4: Run LES simulation (np must match numberOfSubdomains)
#   OF12: the solver application is foamRun; the module (multicomponentFluid)
#   is read from system/controlDict.
NCORES=$(foamDictionary -entry numberOfSubdomains -value system/decomposeParDict)
echo "--- foamRun / multicomponentFluid (${NCORES} cores) ---"
mpirun -np $NCORES foamRun -parallel > log.foamRun 2>&1

# Step 5: Reconstruct
echo "--- reconstructPar ---"
reconstructPar > log.reconstruct 2>&1

echo "=== Done. Run paraFoam to visualize ==="
echo "    Key field: grad_rho (magnitude) = schlieren-like"
