constant/momentumTransport
FoamFile { version 2.0; format ascii; class dictionary; location "constant"; object momentumTransport; }

simulationType  LES;

LES
{
    model           WALE;

    turbulence      on;

    printCoeffs     on;

    delta           cubeRootVol;

    WALECoeffs
    {
        Ck      0.094;
        Ce      1.048;
        Cw      0.325;
    }
}
