constant/reactions
/*
  Li & Dryer H2/O2/N2 mechanism (9 species, 19 reactions) — OF10 format
  Source: Li et al., Int. J. Chem. Kinet. 36 (2004) 566-575
*/
FoamFile { version 2.0; format ascii; class dictionary; location "constant"; object reactions; }

reactions
{
    // R1: H + O2 = O + OH
    r1
    {
        type        irreversibleArrhenius;
        reaction    "H + O2 = O + OH";
        A           3.547e+15;
        beta        -0.406;
        Ta          8352.6;
    }

    // R2: O + H2 = H + OH
    r2
    {
        type        irreversibleArrhenius;
        reaction    "O + H2 = H + OH";
        A           5.08e+4;
        beta        2.67;
        Ta          3165.6;
    }

    // R3: H2 + OH = H2O + H
    r3
    {
        type        irreversibleArrhenius;
        reaction    "H2 + OH = H2O + H";
        A           2.16e+8;
        beta        1.51;
        Ta          1726.0;
    }

    // R4: O + H2O = OH + OH
    r4
    {
        type        irreversibleArrhenius;
        reaction    "O + H2O = OH + OH";
        A           2.97e+6;
        beta        2.02;
        Ta          6743.2;
    }

    // R5: H2 + M = H + H + M
    r5
    {
        type        reversibleThirdBodyArrhenius;
        reaction    "H2 = H + H";
        A           4.577e+19;
        beta        -1.40;
        Ta          52530.0;
        coeffs
        9
        (
            (H2   2.5)
            (H2O 12.0)
            (N2   1.0)
            (O2   1.0)
            (H    1.0)
            (O    1.0)
            (OH   1.0)
            (HO2  1.0)
            (H2O2 1.0)
        );
    }

    // R6: O + O + M = O2 + M
    r6
    {
        type        reversibleThirdBodyArrhenius;
        reaction    "O + O = O2";
        A           6.165e+15;
        beta        -0.50;
        Ta          0.0;
        coeffs
        9
        (
            (H2   2.5)
            (H2O 12.0)
            (N2   1.0)
            (O2   1.0)
            (H    1.0)
            (O    1.0)
            (OH   1.0)
            (HO2  1.0)
            (H2O2 1.0)
        );
    }

    // R7: O + H + M = OH + M
    r7
    {
        type        reversibleThirdBodyArrhenius;
        reaction    "O + H = OH";
        A           4.714e+18;
        beta        -1.0;
        Ta          0.0;
        coeffs
        9
        (
            (H2   2.5)
            (H2O 12.0)
            (N2   1.0)
            (O2   1.0)
            (H    1.0)
            (O    1.0)
            (OH   1.0)
            (HO2  1.0)
            (H2O2 1.0)
        );
    }

    // R8: H + OH + M = H2O + M
    r8
    {
        type        reversibleThirdBodyArrhenius;
        reaction    "H + OH = H2O";
        A           3.8e+22;
        beta        -2.0;
        Ta          0.0;
        coeffs
        9
        (
            (H2   2.5)
            (H2O 12.0)
            (N2   1.0)
            (O2   1.0)
            (H    1.0)
            (O    1.0)
            (OH   1.0)
            (HO2  1.0)
            (H2O2 1.0)
        );
    }

    // R9: H + O2 + M = HO2 + M  (Troe fall-off, N2 bath)
    r9
    {
        type        irreversibleArrheniusTroeFallOff;
        reaction    "H + O2 = HO2";
        k0
        {
            A       6.366e+20;
            beta    -1.72;
            Ta      264.1;
        }
        kInf
        {
            A       1.475e+12;
            beta    0.60;
            Ta      0.0;
        }
        F
        {
            alpha   0.8;
            Tsss    1e-30;
            Ts      1e+30;
            Tss     1e+30;
        }
        thirdBodyEfficiencies
        {
            coeffs
            9
            (
                (H2   2.0)
                (H2O 11.0)
                (O2  0.78)
                (N2   1.0)
                (H    1.0)
                (O    1.0)
                (OH   1.0)
                (HO2  1.0)
                (H2O2 1.0)
            );
        }
    }

    // R10: HO2 + H = H2 + O2
    r10
    {
        type        irreversibleArrhenius;
        reaction    "HO2 + H = H2 + O2";
        A           1.66e+13;
        beta        0.0;
        Ta          414.0;
    }

    // R11: HO2 + H = OH + OH
    r11
    {
        type        irreversibleArrhenius;
        reaction    "HO2 + H = OH + OH";
        A           7.079e+13;
        beta        0.0;
        Ta          148.8;
    }

    // R12: HO2 + O = O2 + OH
    r12
    {
        type        irreversibleArrhenius;
        reaction    "HO2 + O = O2 + OH";
        A           3.25e+13;
        beta        0.0;
        Ta          0.0;
    }

    // R13: HO2 + OH = H2O + O2
    r13
    {
        type        irreversibleArrhenius;
        reaction    "HO2 + OH = H2O + O2";
        A           2.89e+13;
        beta        0.0;
        Ta          -250.0;
    }

    // R14: HO2 + HO2 = H2O2 + O2
    r14
    {
        type        irreversibleArrhenius;
        reaction    "HO2 + HO2 = H2O2 + O2";
        A           4.2e+14;
        beta        0.0;
        Ta          5999.5;
    }

    // R15: H2O2 + M = OH + OH + M  (Troe fall-off)
    r15
    {
        type        irreversibleArrheniusTroeFallOff;
        reaction    "H2O2 = OH + OH";
        k0
        {
            A       1.202e+17;
            beta    0.0;
            Ta      22899.5;
        }
        kInf
        {
            A       2.951e+14;
            beta    0.0;
            Ta      24358.8;
        }
        F
        {
            alpha   0.5;
            Tsss    1e-30;
            Ts      1e+30;
            Tss     1e+30;
        }
        thirdBodyEfficiencies
        {
            coeffs
            9
            (
                (H2   2.5)
                (H2O 12.0)
                (N2   1.0)
                (O2   1.0)
                (H    1.0)
                (O    1.0)
                (OH   1.0)
                (HO2  1.0)
                (H2O2 1.0)
            );
        }
    }

    // R16: H2O2 + H = H2O + OH
    r16
    {
        type        irreversibleArrhenius;
        reaction    "H2O2 + H = H2O + OH";
        A           2.41e+13;
        beta        0.0;
        Ta          1997.8;
    }

    // R17: H2O2 + H = HO2 + H2
    r17
    {
        type        irreversibleArrhenius;
        reaction    "H2O2 + H = HO2 + H2";
        A           4.82e+13;
        beta        0.0;
        Ta          4000.0;
    }

    // R18: H2O2 + O = OH + HO2
    r18
    {
        type        irreversibleArrhenius;
        reaction    "H2O2 + O = OH + HO2";
        A           9.55e+6;
        beta        2.0;
        Ta          1997.8;
    }

    // R19: H2O2 + OH = HO2 + H2O
    r19
    {
        type        irreversibleArrhenius;
        reaction    "H2O2 + OH = HO2 + H2O";
        A           1.0e+12;
        beta        0.0;
        Ta          0.0;
    }
}
