constant/turbulenceProperties.OF9
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }

simulationType  LES;

LES
{
    // WALE: better than Smagorinsky near flame fronts (no need for wall damping)
    // Alternative: "Sigma" is also excellent for flames
    LESModel    WALE;
    delta       cubeRootVol;
    printCoeffs on;

    WALECoeffs
    {
        Ck      0.094;
        Ce      1.048;
        Cw      0.325;
    }
}
