system/decomposeParDict
FoamFile { version 2.0; format ascii; class dictionary; object decomposeParDict; }

numberOfSubdomains  8;   // adjust to your core count
method  scotch;         // auto load-balancing (good for reacting flows)
