system/fvSchemes
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }

ddtSchemes      { default Euler; }      // 1st-order, more stable for stiff reactive flow

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    // Momentum: linear for LES
    div(phi,U)      Gauss linearUpwind grad(U);
    // Enthalpy and species: limited linear (bounded, avoids oscillations near flame)
    div(phi,K)      Gauss linearUpwind grad(K);
    div(phi,h)      Gauss upwind;
    div(phi,Yi_h)   Gauss limitedLinear01 1;
    div(phi,K)      Gauss limitedLinear 1;
    // Turbulent quantities
    div(phi,k)      Gauss limitedLinear 1;
    div(phi,B)      Gauss linear;
    div(B)          Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes { default Gauss linear corrected; }

interpolationSchemes { default linear; }

snGradSchemes { default corrected; }
