system/setFieldsDict
/*
  Set initial fields (generated by Allrun for 8.0 vol% H2 in O2):
  - Outer domain: unburned H2-O2 mixture, T=298K
  - Ignition kernel (r < 3mm): complete-combustion products at T=2000K
  phi = 0.043
*/
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }

// ---------- unburned mixture ----------
defaultFieldValues
(
    volScalarFieldValue T       298.0
    volScalarFieldValue p        101325.0
    volVectorFieldValue U       (0 0 0)
    volScalarFieldValue H2      0.0054
    volScalarFieldValue O2      0.9946
    volScalarFieldValue N2      0.0
    volScalarFieldValue H2O     0.0
    volScalarFieldValue H       0.0
    volScalarFieldValue O       0.0
    volScalarFieldValue OH      0.0
    volScalarFieldValue HO2     0.0
    volScalarFieldValue H2O2    0.0
);

regions
(
    // Ignition kernel: hot products (T=2000K, r < 3mm)
    sphereToCell
    {
        centre  (0 0 0);
        radius  0.003;
        fieldValues
        (
            volScalarFieldValue T       2000.0
            volScalarFieldValue H2      0.0000
            volScalarFieldValue O2      0.9513
            volScalarFieldValue N2      0.0
            volScalarFieldValue H2O     0.0487
            volScalarFieldValue H       0.0
            volScalarFieldValue O       0.0
            volScalarFieldValue OH      0.0
            volScalarFieldValue HO2     0.0
            volScalarFieldValue H2O2    0.0
        );
    }
);
